In [111]:
%CREATE first_db.db;

In [112]:
CREATE TABLE t1(
    date int,
    login varchar(10),
    fio varchar(40)
);

In [113]:
insert into t1
values 
    (1, 'mike', 'mikemikemike'),
    (2, 'mike1', 'mike1mike1mike1'),
    (3, 'mike2', 'mike2mike2mike2');

In [114]:
select * from t1;

+------+-------+-----------------+
| date | login | fio             |
+------+-------+-----------------+
| 1    | mike  | mikemikemike    |
+------+-------+-----------------+
| 2    | mike1 | mike1mike1mike1 |
+------+-------+-----------------+
| 3    | mike2 | mike2mike2mike2 |
+------+-------+-----------------+

In [115]:
CREATE TABLE t2(
    login varchar(10),
    tabel int,
    city varchar(40)
);

In [116]:
insert into t2
values
    ('mike', 123, 'moskva'),
    ('mike1', 124, 'moskva1'),
    ('mike2', 125, 'moskva2');

In [117]:
select * from t2;

+-------+-------+---------+
| login | tabel | city    |
+-------+-------+---------+
| mike  | 123   | moskva  |
+-------+-------+---------+
| mike1 | 124   | moskva1 |
+-------+-------+---------+
| mike2 | 125   | moskva2 |
+-------+-------+---------+

In [118]:
CREATE TABLE t3(
    tabel int,
    level int,
    award int
);

In [119]:
insert into t3
values
    (123, 13, 1000),
    (124, 14, 2000),
    (125, 15, 3000);

In [120]:
select * from t3;

+-------+-------+-------+
| tabel | level | award |
+-------+-------+-------+
| 123   | 13    | 1000  |
+-------+-------+-------+
| 124   | 14    | 2000  |
+-------+-------+-------+
| 125   | 15    | 3000  |
+-------+-------+-------+

In [124]:
select t1.fio, t2.tabel, t3.award, t2.city
from t1 join t2 on t1.login = t2.login join t3 on t2.tabel = t3.tabel;

+-----------------+-------+-------+---------+
| fio             | tabel | award | city    |
+-----------------+-------+-------+---------+
| mikemikemike    | 123   | 1000  | moskva  |
+-----------------+-------+-------+---------+
| mike1mike1mike1 | 124   | 2000  | moskva1 |
+-----------------+-------+-------+---------+
| mike2mike2mike2 | 125   | 3000  | moskva2 |
+-----------------+-------+-------+---------+